In [13]:
import pandas as pd

In [14]:
pd.__version__

'2.2.2'

In [52]:
lst = [1,2,3,4,5,6,7,8]
series = pd.Series(lst)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64
<class 'pandas.core.series.Series'>

In [53]:
lst = [1,2,3]
series =pd.Series(lst)
print(series)
print(type(series))

0    1
1    2
2    3
dtype: int64
<class 'pandas.core.series.Series'>

In [61]:
series = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'] , name = "Alphbets")
#series1 = pd.Series(['a','b','c','d','e'], index = [1,2,3,4, 5])
series

a    1
b    2
c    3
d    4
e    5
Name: Alphbets, dtype: int64

In [78]:
dic = pd.Series({'a':1,'b':2,'c':3})
dic

df = pd.DataFrame(series)
df

   Alphbets
a         1
b         2
c         3
d         4
e         5

In [83]:
lst = [[1,2,3,4,5],[5,4,3,2,1]]
ls = [1,2,3,4,5]
df = pd.DataFrame(lst)
df

   0  1  2  3  4
0  1  2  3  4  5
1  5  4  3  2  1

In [87]:
dic = [{'a':1,'b':2,'c':3},{'a':4,'b':5,'c':6}]
df= pd.DataFrame(dic)
df

   a  b  c
0  1  2  3
1  4  5  6

In [93]:
dict = pd.DataFrame({ "Name":["Abdul","Samad","Chandio"],
                    "Age":[22,23,24],
                    "sex":["male","male","male"]})

dict

      Name  Age   sex
0    Abdul   22  male
1    Samad   23  male
2  Chandio   24  male

In [17]:
a = pd.Series(['a','b','c'], index = [1,2,3] , name = "Alphbets")
a

1    a
2    b
3    c
Name: Alphbets, dtype: object

In [18]:
dict_series = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
dict_series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [19]:
dict_series[:-1]

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
max(dict_series)

5

In [21]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [19]:
df = pd.DataFrame(lst)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [22]:
lst = [[1,2,3,4,5,6],[7,8,9,1,2,3]]
df = pd.DataFrame(lst)
df

   0  1  2  3  4  5
0  1  2  3  4  5  6
1  7  8  9  1  2  3

In [23]:
dict=[{'a':1,'b':2,'c':3,'d':4,'e':5},{'a':1,'b':2,'c':3,'d':4,'e':5}]
df = pd.DataFrame(dict)
df

   a  b  c  d  e
0  1  2  3  4  5
1  1  2  3  4  5

In [46]:
df = pd.DataFrame(
    {
        "Name":["Abdul","Samad","Chandio"],
        "Age":[20,22,24],
        "Sex":["Male","Male","Female"]
    }
)

df

      Name  Age     Sex
0    Abdul   20    Male
1    Samad   22    Male
2  Chandio   24  Female

In [25]:
df["Age"]

0    20
1    22
2    24
Name: Age, dtype: int64

In [26]:
df["Name"]

0      Abdul
1      Samad
2    Chandio
Name: Name, dtype: object

In [49]:
df = pd.read_csv('iris.csv')
df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             NaN          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [29]:
df.shape

(150, 5)

In [31]:
df.size

750

In [32]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           NaN          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [35]:
df.head(2)

   sepal.length  sepal.width  petal.length  petal.width variety
0           NaN          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa

In [36]:
df.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [37]:
df.tail(2)

     sepal.length  sepal.width  petal.length  petal.width    variety
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [38]:
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    149.000000   150.000000    150.000000   150.000000
mean       5.848322     3.057333      3.758000     1.199333
std        0.828594     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  149 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [40]:
df.isnull().head()

   sepal.length  sepal.width  petal.length  petal.width  variety
0          True        False         False        False    False
1         False        False         False        False    False
2         False        False         False        False    False
3         False        False         False        False    False
4         False        False         False        False    False

In [43]:
df.isnull().sum()

sepal.length    1
sepal.width     0
petal.length    0
petal.width     0
variety         0
dtype: int64

In [44]:
df=df.dropna()
df

     sepal.length  sepal.width  petal.length  petal.width    variety
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
5             5.4          3.9           1.7          0.4     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[149 rows x 5 columns]